tutorials/N2.jet.LES/c4.LEMOS.PR/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    //mixture         SRKchungKineticReactingMixture;
    //mixture         SRKchungTakaReactingMixture;
    mixture         PRchungTakaReactingMixture;
    //mixture         PRchungKineticReactingMixture;
    //transport       chungKinetic;
    transport       chungTaka;
    thermo          rfJanaf;
    energy          sensibleEnthalpy;
    //equationOfState soaveRedlichKwong;
    equationOfState PengRobinson;
    specie          rfSpecie;
}


//ideal gas
/*
thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}
*/

inertSpecie N2;

chemistryReader foamChemistryReader;
foamChemistryFile "$FOAM_CASE/constant/reactions";
foamChemistryThermoFile "$FOAM_CASE/constant/thermo.inputData";

// ************************************************************************* //
