tutorials/N2.jet.LES/c4.LEMOS.PR/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description

\*---------------------------------------------------------------------------*/

fieldAverage1
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    writeControl      runTime;
    writeInterval     0.001;

    // Mandatory entries (runtime modifiable)
    fields
    (
	T
        {
            mean        on;
            prime2Mean  on;
            base        time; //iteration;
        }

        rho
        {   
            mean        on;
            prime2Mean  on;
            base        time; //iteration;
        }

        U
        {
            mean        on;
            prime2Mean  on;
            base        time; //iteration;
        }

        N2
        {
            mean        on;
            prime2Mean  on;
            base        time; //iteration;
        }

    );

    // Optional entries (runtime modifiable)
    //restartOnRestart    false;
    //restartOnOutput     false;
    //periodicRestart     false;
    //restartPeriod       0.002;

    // Optional (inherited) entries
    //region          region0;
    //enabled         true;
    //log             true;
    timeStart       0.15;
    timeEnd         0.35;
    //executeControl  timeStep;
    //executeInterval 1;
    //writeControl    timeStep;
    //writeInterval   1;
 }
